test/resources/mcbs/mcbs-voucher-invoice.xml

<?xml version="1.0" encoding="UTF-8"?>
<DOCUMENT>
<TYPE>RG</TYPE>
<ID>150902_999999999_0</ID>
<HEADER>
<BILLING_SYSTEM>MCBS 187.0.1</BILLING_SYSTEM>
<SOURCE_SYSTEM>LIFE</SOURCE_SYSTEM>
<MANDANT>MC</MANDANT>
<LAYOUT>
<PDC>201229c</PDC>
<INI>210504</INI>
</LAYOUT>
<EXT_VERSION>-</EXT_VERSION>
<XML_VERSION>R2021.1</XML_VERSION>
<INVOICE_DATE>19.02.2026</INVOICE_DATE>
<INV_DETAILS>
<INV_DETAIL>
<CONTEXT>PRECTR</CONTEXT>
<ID>RGTX</ID>
<VALUE>domainumstellung-freenet-20260120</VALUE>
</INV_DETAIL>
</INV_DETAILS>
<BRAND>
<CODE_SHORTCUT>MCM</CODE_SHORTCUT>
<CODE_DESC>freenet DLS GmbH</CODE_DESC>
<SHORTCUT>MOBILCOM_DEBITEL</SHORTCUT>
<DESC>freenet DLS GmbH</DESC>
<GROUP_SHORTCUT>MC</GROUP_SHORTCUT>
<GROUP_DESC>Mobilcom</GROUP_DESC>
</BRAND>
<CLIENTBANK_ACNT>DE02200400600971477600</CLIENTBANK_ACNT>
<CLIENTBANK_CODE>COBADEFFXXX</CLIENTBANK_CODE>
<DELIVERY_MODE>
<SUPPLY>
<TYPE>PORTAL</TYPE>
</SUPPLY>
<NOTIFICATION>
<TYPE>EMAIL</TYPE>
<ENTRY>erika.mustermann@example.com</ENTRY>
</NOTIFICATION>
</DELIVERY_MODE>
<REUNITE>
<ID>999999999</ID>
<SORT>150902_999999999_0</SORT>
</REUNITE>
<CURRENT_DATE>19.02.2026</CURRENT_DATE>
<CURRENT_TIME>01:54:39</CURRENT_TIME>
<BILLRUN_ID>150902</BILLRUN_ID>
<BILLRUN_DATE>19.02.2026</BILLRUN_DATE>
<INVOICE_TYPE>ORIGINAL</INVOICE_TYPE>
<INVOICE_DEF>999999999</INVOICE_DEF>
<INVOICE_NO>M26099999999</INVOICE_NO>
<INV_CURRENCY>EUR</INV_CURRENCY>
<EURO_INVOICE>TRUE</EURO_INVOICE>
<END_BY_CUSTOMER>TRUE</END_BY_CUSTOMER>
<SHOW_COSTCENTRE>FALSE</SHOW_COSTCENTRE>
<REPRINT>FALSE</REPRINT>
</HEADER>
<RECIPIENT>
<PERSON_NO>999999999</PERSON_NO>
<BILL_PERSON_NO>999999998</BILL_PERSON_NO>
<OPENING>Hallo Erika</OPENING>
<ADDRESS>
<SHORT_OPENING>Frau</SHORT_OPENING>
<FIRSTNAME>Erika</FIRSTNAME>
<NAME>Mustermann</NAME>
<STREET>Musterstraße 1</STREET>
<POSTCODE>12345</POSTCODE>
<CITY>Musterstadt</CITY>
</ADDRESS>
<COM_INFOS>
<COM_INFO>
<TYPE>TEL</TYPE>
<ENTRY>+490171111111111</ENTRY>
<CONTEXT>PRIVATE</CONTEXT>
</COM_INFO>
<COM_INFO>
<TYPE>EML</TYPE>
<ENTRY>erika.mustermann@example.com</ENTRY>
<CONTEXT>EMAIL_NOTIFY</CONTEXT>
</COM_INFO>
</COM_INFOS>
<GENDER>FEMALE</GENDER>
<BIRTHDAY>01.01.1970</BIRTHDAY>
<AGE_ON_BILLDATE>56</AGE_ON_BILLDATE>
</RECIPIENT>
<CUSTOMER>
<TYPE_SHORTCUT>PP</TYPE_SHORTCUT>
<TYPE_ATTRIBUTES>P___</TYPE_ATTRIBUTES>
<MRKTG_PERMITS>
<MRKTG_PERMIT>
<INITIATOR>CUSTOMER</INITIATOR>
<CLASSIFICATION>NONVOICE</CLASSIFICATION>
</MRKTG_PERMIT>
<MRKTG_PERMIT>
<INITIATOR>DEALER</INITIATOR>
<CLASSIFICATION>KEW</CLASSIFICATION>
</MRKTG_PERMIT>
<MRKTG_PERMIT>
<INITIATOR>SERVICE_PROVIDER</INITIATOR>
<CLASSIFICATION>KEW</CLASSIFICATION>
</MRKTG_PERMIT>
</MRKTG_PERMITS>
<MAIN_NETWORK>O2</MAIN_NETWORK>
<RECIPIENT_DIFF>FALSE</RECIPIENT_DIFF>
</CUSTOMER>
<INVOICE_DATA>
<PAYMENT_MODE>
<PAYMENT_TYPE>SEPADEBIT</PAYMENT_TYPE>
<ACCOUNT_OWNER>
<CUSTOMER_DIFF>FALSE</CUSTOMER_DIFF>
</ACCOUNT_OWNER>
<SEPA_MANDATE>MC-999999999-000001</SEPA_MANDATE>
<BANK_ACCOUNT>DE89370400440000000000</BANK_ACCOUNT>
<BANK_CODE>COBADEFFXXX</BANK_CODE>
<PAYMENT_TERM>1</PAYMENT_TERM>
<DUE_DATE>26.02.2026</DUE_DATE>
</PAYMENT_MODE>
<BALANCE_DATE>18.02.2026</BALANCE_DATE>
<FRAMES>
<NUMBERS>2</NUMBERS>
<UNITS>1</UNITS>
<AMOUNTS>
<NUMBERS>7</NUMBERS>
<AMOUNT>
<TYPE>INSEP_GROSS</TYPE>
<VALUE>11,9700</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>SUBTOTAL</TYPE>
<VALUE>18,99</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>TOTAL</TYPE>
<VALUE>30,96</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>TOTAL_NET</TYPE>
<VALUE>15,9580</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>TOTAL_VAT</TYPE>
<VALUE>3,03</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>TO_PAY</TYPE>
<VALUE>80,43</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>UNPAID</TYPE>
<VALUE>49,47</VALUE>
</AMOUNT>
</AMOUNTS>
<DIFF_VATS>
<NUMBERS>1</NUMBERS>
<DIFF_VAT>
<VAT_RATE>19</VAT_RATE>
<VAT>3,03</VAT>
<NET>15,9580</NET>
</DIFF_VAT>
</DIFF_VATS>
<FRAME>
<ID>VOUCHERS</ID>
<TITLE>Ihr Kontostand zum 18.02.2026</TITLE>
<SHOW_TITLE>TRUE</SHOW_TITLE>
<NUMBERS>1</NUMBERS>
<AMOUNTS>
<NUMBERS>3</NUMBERS>
<AMOUNT>
<TYPE>INSEP_GROSS</TYPE>
<VALUE>49,47</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>PRIMARY_SUM</TYPE>
<VALUE>49,47</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>TOTAL_NET</TYPE>
<VALUE>0,00</VALUE>
</AMOUNT>
</AMOUNTS>
<AREA>
<NUMBERS>1</NUMBERS>
<UNIT>
<SECTIONS>
<NUMBERS>1</NUMBERS>
<SECTION>
<TITLE>Kontostand</TITLE>
<SHOW_SUBTOTAL>FALSE</SHOW_SUBTOTAL>
<SUBTOTAL>49,47</SUBTOTAL>
<BILLITEM_GRPS>
<NUMBERS>1</NUMBERS>
<BILLITEM_GRP>
<TITLE>Kontobewegungen</TITLE>
<SHOW_COUNT>FALSE</SHOW_COUNT>
<BILLITEMS>
<NUMBERS>7</NUMBERS>
<BILLITEM>
<SEQUENCE_NO>1</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<PRODUCT_NAME>Verzugszinsen</PRODUCT_NAME>
<PRODUCT_CODE>RH</PRODUCT_CODE>
<PERIOD>14.09.2025</PERIOD>
<CHARGE>0,20</CHARGE>
<SUBTOTALS>
<CHARGE_SUBTOTAL>0,20</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>0,20</UNIT_SUBTOTAL>
<FRAME_SUBTOTAL>0,20</FRAME_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>2</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<PRODUCT_NAME>Rechnung M25099999901</PRODUCT_NAME>
<PRODUCT_CODE>MB</PRODUCT_CODE>
<PERIOD>20.11.2025</PERIOD>
<CHARGE>0,81</CHARGE>
<SUBTOTALS>
<CHARGE_SUBTOTAL>1,01</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>1,01</UNIT_SUBTOTAL>
<FRAME_SUBTOTAL>1,01</FRAME_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>3</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<PRODUCT_NAME>Verzugszinsen</PRODUCT_NAME>
<PRODUCT_CODE>RH</PRODUCT_CODE>
<PERIOD>23.11.2025</PERIOD>
<CHARGE>0,08</CHARGE>
<SUBTOTALS>
<CHARGE_SUBTOTAL>1,09</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>1,09</UNIT_SUBTOTAL>
<FRAME_SUBTOTAL>1,09</FRAME_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>4</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<PRODUCT_NAME>Rechnung M25099999902</PRODUCT_NAME>
<PRODUCT_CODE>MB</PRODUCT_CODE>
<PERIOD>19.12.2025</PERIOD>
<CHARGE>23,49</CHARGE>
<SUBTOTALS>
<CHARGE_SUBTOTAL>24,58</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>24,58</UNIT_SUBTOTAL>
<FRAME_SUBTOTAL>24,58</FRAME_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>5</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<PRODUCT_NAME>Rechnung M26099999903</PRODUCT_NAME>
<PRODUCT_CODE>MB</PRODUCT_CODE>
<PERIOD>22.01.2026</PERIOD>
<CHARGE>18,99</CHARGE>
<SUBTOTALS>
<CHARGE_SUBTOTAL>43,57</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>43,57</UNIT_SUBTOTAL>
<FRAME_SUBTOTAL>43,57</FRAME_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>6</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<PRODUCT_NAME>Mahnkosten</PRODUCT_NAME>
<PRODUCT_CODE>MS</PRODUCT_CODE>
<PERIOD>29.01.2026</PERIOD>
<CHARGE>2,95</CHARGE>
<SUBTOTALS>
<CHARGE_SUBTOTAL>46,52</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>46,52</UNIT_SUBTOTAL>
<FRAME_SUBTOTAL>46,52</FRAME_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
<BILLITEM>
<SEQUENCE_NO>7</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<PRODUCT_NAME>Mahnkosten</PRODUCT_NAME>
<PRODUCT_CODE>MS</PRODUCT_CODE>
<PERIOD>13.02.2026</PERIOD>
<CHARGE>2,95</CHARGE>
<SUBTOTALS>
<CHARGE_SUBTOTAL>49,47</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>49,47</UNIT_SUBTOTAL>
<FRAME_SUBTOTAL>49,47</FRAME_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
</BILLITEMS>
</BILLITEM_GRP>
</BILLITEM_GRPS>
</SECTION>
</SECTIONS>
</UNIT>
</AREA>
</FRAME>
<FRAME>
<ID>TELCO</ID>
<TITLE>Mobilfunk-Vertragsabrechnungen</TITLE>
<SHOW_TITLE>TRUE</SHOW_TITLE>
<SHOW_SEQUENCES>FALSE</SHOW_SEQUENCES>
<NUMBERS>1</NUMBERS>
<AMOUNTS>
<NUMBERS>3</NUMBERS>
<AMOUNT>
<TYPE>INSEP_GROSS</TYPE>
<VALUE>11,9700</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>PRIMARY_SUM</TYPE>
<VALUE>27,9280</VALUE>
</AMOUNT>
<AMOUNT>
<TYPE>TOTAL_NET</TYPE>
<VALUE>15,9580</VALUE>
</AMOUNT>
</AMOUNTS>
<AREA>
<ID>STANDARD</ID>
<NUMBERS>1</NUMBERS>
<UNIT>
<SEQUENCE_NO>1</SEQUENCE_NO>
<CONTRACT_DATA>
<TYPE>TELCO</TYPE>
<CONTRACT_NO>299999999</CONTRACT_NO>
<CLASSIFICATION>2</CLASSIFICATION>
<TARIFF_SHORTCUT>O2MM-MOULB5G1MSO</TARIFF_SHORTCUT>
<TARIFF>o2 Mobile Unlimited Basic (monatlich kündbar)</TARIFF>
<NETWORK>O2</NETWORK>
<TECHNOLOGY>2G</TECHNOLOGY>
<SUBSEGMENT>CR</SUBSEGMENT>
<CUSTOMER_NO>999999999</CUSTOMER_NO>
<TCS_TITLE>Teilnehmer:</TCS_TITLE>
<TCS_VALUE>Erika Mustermann</TCS_VALUE>
<CONNECTS>
<CONNECT>
<TYPE>MAIN</TYPE>
<TITLE>Mobilfunk-Rufnummer</TITLE>
<CONNECT_NO>017699999999</CONNECT_NO>
<CONNECT_NO_F>0176 / 99999999</CONNECT_NO_F>
<SIM_NO>8949228243100000000</SIM_NO>
</CONNECT>
</CONNECTS>
<TRANSPARENCY>
<BOOKED_AMOUNTS>2</BOOKED_AMOUNTS>
<BOOKED_AMOUNT>
<START_DATE>01.02.2026</START_DATE>
<END_DATE>28.02.2026</END_DATE>
<TYPE>DATA_VOLUME</TYPE>
<ORDERED>976 GB</ORDERED>
<USED>209 GB</USED>
</BOOKED_AMOUNT>
<BOOKED_AMOUNT>
<START_DATE>01.01.2026</START_DATE>
<END_DATE>31.01.2026</END_DATE>
<TYPE>DATA_VOLUME</TYPE>
<ORDERED>976 GB</ORDERED>
<USED>449 GB</USED>
</BOOKED_AMOUNT>
</TRANSPARENCY>
<EVN_SERVICE>
<MODEL>STANDARD</MODEL>
<SHOW_EVN>FALSE</SHOW_EVN>
</EVN_SERVICE>
<CALL_STORAGE>
<STORE_DAYS>90</STORE_DAYS>
<STORE_FORMAT>SK</STORE_FORMAT>
<PRINT_FORMAT>EK</PRINT_FORMAT>
</CALL_STORAGE>
<DETAILS>
<DETAIL>
<CONTEXT>NETWORK</CONTEXT>
<ID>O2</ID>
<VALUE>2024-12-04</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>BILLOUTPUT</CONTEXT>
<ID>PHONE_NUMEBR</ID>
<VALUE>04917699999999</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>BILLOUTPUT</CONTEXT>
<ID>SIM_NUMEBR</ID>
<VALUE>8949228243100000000</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>BILLOUTPUT</CONTEXT>
<ID>CALL_STORE</ID>
<VALUE>90SKEK</VALUE>
</DETAIL>
<DETAIL>
<CONTEXT>LAYOUT</CONTEXT>
<ID>NONE</ID>
<VALUE>TRUE</VALUE>
</DETAIL>
</DETAILS>
</CONTRACT_DATA>
<SECTIONS>
<NUMBERS>3</NUMBERS>
<SECTION>
<TITLE>Zwischensumme netto</TITLE>
<SHOW_SUBTOTAL>TRUE</SHOW_SUBTOTAL>
<SUBTOTAL>27,7227</SUBTOTAL>
<BILLITEM_GRPS>
<NUMBERS>2</NUMBERS>
<BILLITEM_GRP>
<TITLE>Basisleistungen</TITLE>
<PERIOD>01.02.2026 - 28.02.2026</PERIOD>
<PERIOD_F></PERIOD_F>
<CHARGE>27,7227</CHARGE>
<SHOW_COUNT>TRUE</SHOW_COUNT>
<BILLITEMS>
<NUMBERS>1</NUMBERS>
<BILLITEM>
<SEQUENCE_NO>1</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<TYPE>GG</TYPE>
<PRODUCT_TYPE>SERVICE</PRODUCT_TYPE>
<PRODUCT_NAME>Grundgebühr</PRODUCT_NAME>
<PRODUCT_CODE>10001</PRODUCT_CODE>
<PERIOD>01.02.2026 - 28.02.2026</PERIOD>
<CHARGE>27,7227</CHARGE>
<DISCOUNT>-11,7647</DISCOUNT>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>3</BILLING_REF>
<SUBTOTALS>
<CHARGE_SUBTOTAL>27,7227</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>27,7227</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
</BILLITEMS>
</BILLITEM_GRP>
<BILLITEM_GRP>
<TITLE>Verbindungen</TITLE>
<PERIOD>20.01.2026 - 17.02.2026</PERIOD>
<PERIOD_F></PERIOD_F>
<CHARGE>0,0000</CHARGE>
<SHOW_COUNT>TRUE</SHOW_COUNT>
<BILLITEMS>
<NUMBERS>1</NUMBERS>
<BILLITEM>
<SEQUENCE_NO>2</SEQUENCE_NO>
<CONNECT_CAT>DATA</CONNECT_CAT>
<COUNTER>35</COUNTER>
<TYPE>DATA</TYPE>
<PRODUCT_TYPE>CALL</PRODUCT_TYPE>
<PRODUCT_NAME>Datenverbindungen (DATA)</PRODUCT_NAME>
<PRODUCT_CODE>123</PRODUCT_CODE>
<PERIOD>20.01.2026 - 17.02.2026</PERIOD>
<CHARGE>0,0000</CHARGE>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>4</BILLING_REF>
<CLAIM_PRODUCT>24111</CLAIM_PRODUCT>
<SUBTOTALS>
<CHARGE_SUBTOTAL>27,7227</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>27,7227</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
</BILLITEMS>
</BILLITEM_GRP>
</BILLITEM_GRPS>
</SECTION>
<SECTION>
<TITLE>Gutschriften</TITLE>
<SHOW_SUBTOTAL>FALSE</SHOW_SUBTOTAL>
<SUBTOTAL>-11,7647</SUBTOTAL>
<BILLITEM_GRPS>
<NUMBERS>1</NUMBERS>
<BILLITEM_GRP>
<TITLE>Ihre freenet Vorteile</TITLE>
<PERIOD>01.02.2026 - 28.02.2026</PERIOD>
<PERIOD_F></PERIOD_F>
<CHARGE>-11,7647</CHARGE>
<SHOW_COUNT>TRUE</SHOW_COUNT>
<BILLITEMS>
<NUMBERS>1</NUMBERS>
<BILLITEM>
<SEQUENCE_NO>3</SEQUENCE_NO>
<COUNTER>1</COUNTER>
<TYPE>ASKVRaMGP1400</TYPE>
<PRODUCT_TYPE>SERVICE</PRODUCT_TYPE>
<PRODUCT_NAME>14,00 EUR Rabatt auf Monatsgrundpreis dauerhaft</PRODUCT_NAME>
<PRODUCT_CODE>31477</PRODUCT_CODE>
<PERIOD>01.02.2026 - 28.02.2026</PERIOD>
<CHARGE>-11,7647</CHARGE>
<VAT_RATE>19</VAT_RATE>
<BILLING_REF>8</BILLING_REF>
<SUBTOTALS>
<CHARGE_SUBTOTAL>15,9580</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>15,9580</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
</BILLITEMS>
</BILLITEM_GRP>
</BILLITEM_GRPS>
</SECTION>
<SECTION>
<TITLE>Sonderdienste Drittanbieter (brutto)</TITLE>
<SHOW_SUBTOTAL>TRUE</SHOW_SUBTOTAL>
<SUBTOTAL>11,9700</SUBTOTAL>
<BILLITEM_GRPS>
<NUMBERS>1</NUMBERS>
<BILLITEM_GRP>
<TITLE>Nutzung Sonderdienste Drittanbieter (brutto)</TITLE>
<PERIOD>25.01.2026 - 08.02.2026</PERIOD>
<PERIOD_F></PERIOD_F>
<CHARGE>11,9700</CHARGE>
<SHOW_COUNT>TRUE</SHOW_COUNT>
<BILLITEMS>
<NUMBERS>1</NUMBERS>
<BILLITEM>
<SEQUENCE_NO>4</SEQUENCE_NO>
<CONNECT_CAT>NONE</CONNECT_CAT>
<COUNTER>3</COUNTER>
<TYPE>SFG</TYPE>
<PRODUCT_TYPE>CALL</PRODUCT_TYPE>
<PRODUCT_NAME>Sonderdienste Drittanbieter (SFG)</PRODUCT_NAME>
<PRODUCT_CODE>13468</PRODUCT_CODE>
<PERIOD>25.01.2026 - 08.02.2026</PERIOD>
<CHARGE>11,9700</CHARGE>
<VAT_RATE>INCLUDED</VAT_RATE>
<BILLING_REF>6</BILLING_REF>
<OPT_PARAMS>
<CONT_PROVIDER>
<ID>999999999</ID>
<CONTACT>Musterfirma GmbH, Musterstraße 1, D-12345 Musterstadt, Tel.: 089999999999, E-Mail: kontakt@musterfirma.example.com</CONTACT>
<SERVICES>3x WEB-ABO-News&amp;Info 11,9700 EUR</SERVICES>
</CONT_PROVIDER>
</OPT_PARAMS>
<SUBTOTALS>
<CHARGE_SUBTOTAL>27,9280</CHARGE_SUBTOTAL>
<UNIT_SUBTOTAL>27,9280</UNIT_SUBTOTAL>
</SUBTOTALS>
</BILLITEM>
</BILLITEMS>
</BILLITEM_GRP>
</BILLITEM_GRPS>
</SECTION>
</SECTIONS>
</UNIT>
</AREA>
</FRAME>
</FRAMES>
<TEXT_MODULES>
<NUMBERS>1</NUMBERS>
<TEXT_MODULE>
<NAME>DISCOUNT</NAME>
<DATA>14,00</DATA>
</TEXT_MODULE>
</TEXT_MODULES>
</INVOICE_DATA>
</DOCUMENT>